import numpy as np

#1

A = np.matrix([[1, 54], [1, 6], [2, 7]])
A = np.transpose(A)
print(f'Транспанированная матрица A - \n {A}')

B = np.matrix([[1, 7, 8], [4, 2, 9], [5, 6, 3]])
B = np.transpose(B)
print(f'Транспонированная матрица B - \n {B}')

#2
print('************************************************************')
#a.
print('a.')

A = np.matrix([[1, 2], [4, 5], [7, 8]])
B = np.matrix([[1, 1, 0], [0, 1, 1], [1, 0, 1]])

try:
    r = np.dot(A, B)
    print(r)
except:
    print('Эти матрицы не перемножаются из-за несоответствия условиям матричного умножения.')


#b.
print('b.')

A = np.matrix([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
B = np.matrix([[1, 1, 0], [0, 1, 1], [1, 0, 1]])
r = np.dot(A, B)
print(f'Результат умножения матриц - \n {r}')


#3
print('************************************************************')

X = np.matrix([[1, 145], [2, 163], [3, 240], [3, 350], [4, 421], [4, 397], [5, 620]])
Y = np.array([[80], [170], [100], [220], [200], [270], [500]])
exp1 = X.T * X
exp2 = X.T * Y
r = exp2 / exp1
print(f'Вектор оптимальных весов - \n {r}')